Examinator/src/Enums/ВариантыРазмещенияКнопкиВыходаСУЗ/ВариантыРазмещенияКнопкиВыходаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРазмещенияКнопкиВыходаСУЗ</name>
  <enumValues>
    <name>СправаИсчезающая</name>
  </enumValues>
  <enumValues>
    <name>СправаФиксированная</name>
  </enumValues>
  <enumValues>
    <name>СлеваИсчезающая</name>
  </enumValues>
  <enumValues>
    <name>СлеваФиксированная</name>
  </enumValues>
  <enumValues>
    <name>БезКнопки</name>
  </enumValues>
  <enumValues>
    <name>ВКоманднойПанели</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыРазмещенияКнопкиВыходаСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВСтроку(Значение) Экспорт
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ВКоманднойПанели Тогда
		Возврат "auto";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.БезКнопки Тогда
		Возврат "hidden";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваИсчезающая Тогда
		Возврат "left";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаИсчезающая Тогда
		Возврат "right";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваФиксированная Тогда
		Возврат "leftFix";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаФиксированная Тогда
		Возврат "rightFix";
	КонецЕсли;
	
	Возврат "auto";
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
